experiments_old/02_heartbeat_sinusoidal/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pressure-driven pulsatile flow: velocity is NOT prescribed at the boundary.
// The parabolic profile develops naturally from the time-varying pressure
// gradient set in 0/p.
//
// Expected steady periodic state (Hagen-Poiseuille):
//   U_center(t) = 0.275 + 0.225·sin(2πt/0.857 − π/2)  [m/s]
//   U_avg(t)    = U_center(t) / 2
//   Re_peak     = U_avg_peak · 2R / ν
//               = 0.25 · 0.01 / 3.3e-6  ≈ 757   (laminar ✓)
//
// Initial condition (t=0): zero velocity everywhere.
// The flow builds up from rest driven by the pressure gradient in 0/p.
// Expect ~2 viscous timescales (τ ≈ R²/ν ≈ 7.6 s each) before the
// periodic-steady Womersley profile is established (≈ 15 s total).

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // Velocity develops freely from the pressure gradient.
        type            zeroGradient;
    }

    outlet
    {
        // Allow flow to exit without constraining the velocity profile.
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
